# AI-Lab: 09
### Rollnumber: BSAIM-F24-195
### Name: Aman Ali

<div class="alert alert-block alert-success">
    Import <b>Libraries</b>
</div>

In [1]:
import pandas as pd

<div class="alert alert-block alert-info">
    1. <b>Data Gathering</b>
    <br>
    2. <b>Data Loading</b>
</div>

In [2]:
df = pd.read_excel("data.xlsx")
df

,StudentID,Gender,Age,StudyHoursPerWeek,AttendanceRate,GPA,Major,PartTimeJob,ExtraCurricularActivities
0,1.0,Male,24.0,37.0,90.75,3.47,Arts,Yes,No
1,2.0,Female,22.0,37.0,74.90,2.32,Education,No,No
2,3.0,Male,22.0,10.0,53.36,2.38,Business,No,No
3,4.0,Male,24.0,10.0,70.26,3.46,Science,Yes,No
4,5.0,Male,18.0,19.0,74.87,2.31,Education,Yes,No
...,...,...,...,...,...,...,...,...,...
495,496.0,Male,22.0,37.0,76.61,2.97,Science,No,No
496,497.0,Male,23.0,11.0,56.29,3.20,Science,No,No
497,498.0,Female,20.0,6.0,56.64,3.20,Science,No,Yes
498,499.0,Male,22.0,18.0,57.18,2.05,Business,No,Yes
499,500.0,Female,24.0,21.0,96.99,2.64,Engineering,No,No

<div class="alert alert-block alert-info">
    3. <b>Data Exploration</b>
</div>

In [3]:
df.head()

,StudentID,Gender,Age,StudyHoursPerWeek,AttendanceRate,GPA,Major,PartTimeJob,ExtraCurricularActivities
0,1.0,Male,24.0,37.0,90.75,3.47,Arts,Yes,No
1,2.0,Female,22.0,37.0,74.90,2.32,Education,No,No
2,3.0,Male,22.0,10.0,53.36,2.38,Business,No,No
3,4.0,Male,24.0,10.0,70.26,3.46,Science,Yes,No
4,5.0,Male,18.0,19.0,74.87,2.31,Education,Yes,No

In [4]:
df.tail()

,StudentID,Gender,Age,StudyHoursPerWeek,AttendanceRate,GPA,Major,PartTimeJob,ExtraCurricularActivities
495,496.0,Male,22.0,37.0,76.61,2.97,Science,No,No
496,497.0,Male,23.0,11.0,56.29,3.20,Science,No,No
497,498.0,Female,20.0,6.0,56.64,3.20,Science,No,Yes
498,499.0,Male,22.0,18.0,57.18,2.05,Business,No,Yes
499,500.0,Female,24.0,21.0,96.99,2.64,Engineering,No,No

In [5]:
df.columns

Index(['StudentID', 'Gender', 'Age', 'StudyHoursPerWeek', 'AttendanceRate',
       'GPA', 'Major', 'PartTimeJob', 'ExtraCurricularActivities'],
      dtype='object')

In [6]:
df.count()

StudentID                    499
Gender                       460
Age                          460
StudyHoursPerWeek            460
AttendanceRate               460
GPA                          500
Major                        478
PartTimeJob                  478
ExtraCurricularActivities    478
dtype: int64

In [7]:
df.describe()

        StudentID         Age  StudyHoursPerWeek  AttendanceRate        GPA
count  499.000000  460.000000         460.000000      460.000000  500.00000
mean   250.801603   20.960870          19.782609       74.830217    2.98516
std    144.469180    1.995253          11.539669       14.725526    0.56362
min      1.000000   18.000000           1.000000       50.010000    2.00000
25%    126.500000   19.000000           9.750000       62.177500    2.48750
50%    251.000000   21.000000          20.000000       75.070000    3.00000
75%    375.500000   23.000000          30.000000       87.220000    3.48000
max    500.000000   24.000000          39.000000       99.970000    3.99000

In [8]:
df.describe(include='all')

,StudentID,Gender,Age,StudyHoursPerWeek,AttendanceRate,GPA,Major,PartTimeJob,ExtraCurricularActivities
count,499.000000,460,460.000000,460.000000,460.000000,500.00000,478,478,478
unique,NaN,2,NaN,NaN,NaN,NaN,5,2,2
top,NaN,Female,NaN,NaN,NaN,NaN,Business,Yes,No
freq,NaN,233,NaN,NaN,NaN,NaN,111,255,250
mean,250.801603,NaN,20.960870,19.782609,74.830217,2.98516,NaN,NaN,NaN
std,144.469180,NaN,1.995253,11.539669,14.725526,0.56362,NaN,NaN,NaN
min,1.000000,NaN,18.000000,1.000000,50.010000,2.00000,NaN,NaN,NaN
25%,126.500000,NaN,19.000000,9.750000,62.177500,2.48750,NaN,NaN,NaN
50%,251.000000,NaN,21.000000,20.000000,75.070000,3.00000,NaN,NaN,NaN
75%,375.500000,NaN,23.000000,30.000000,87.220000,3.48000,NaN,NaN,NaN
max,500.000000,NaN,24.000000,39.000000,99.970000,3.99000,NaN,NaN,NaN

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   StudentID                  499 non-null    float64
 1   Gender                     460 non-null    object
 2   Age                        460 non-null    float64
 3   StudyHoursPerWeek          460 non-null    float64
 4   AttendanceRate             460 non-null    float64
 5   GPA                        500 non-null    float64
 6   Major                      478 non-null    object
 7   PartTimeJob                478 non-null    object
 8   ExtraCurricularActivities  478 non-null    object
dtypes: float64(5), object(4)
memory usage: 35.3+ KB

In [10]:

print('rows: ', df.shape[0]) 
print('columns: ', df.shape[1])

rows:  500
columns:  9

In [11]:
df.isnull().sum()

StudentID                     1
Gender                       40
Age                          40
StudyHoursPerWeek            40
AttendanceRate               40
GPA                           0
Major                        22
PartTimeJob                  22
ExtraCurricularActivities    22
dtype: int64

In [12]:
df.nunique()

StudentID                    499
Gender                         2
Age                            7
StudyHoursPerWeek             39
AttendanceRate               440
GPA                          184
Major                          5
PartTimeJob                    2
ExtraCurricularActivities      2
dtype: int64

In [13]:
def mean_col(col):
    return df[col].mean()

def median_col(col):
    return df[col].median()

def mod_col(col):
    return df[col].mode()[0]

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   StudentID                  499 non-null    float64
 1   Gender                     460 non-null    object
 2   Age                        460 non-null    float64
 3   StudyHoursPerWeek          460 non-null    float64
 4   AttendanceRate             460 non-null    float64
 5   GPA                        500 non-null    float64
 6   Major                      478 non-null    object
 7   PartTimeJob                478 non-null    object
 8   ExtraCurricularActivities  478 non-null    object
dtypes: float64(5), object(4)
memory usage: 35.3+ KB

In [18]:
print("Mean of Age is  : ", mean_col("Age"))
print("Mode of Major is  : ", mod_col("Major"))

Mean of Age is  :  20.96086956521739
Mode of Major is  :  Business

In [19]:
df.dtypes

StudentID                    float64
Gender                        object
Age                          float64
StudyHoursPerWeek            float64
AttendanceRate               float64
GPA                          float64
Major                         object
PartTimeJob                   object
ExtraCurricularActivities     object
dtype: object